# AncillaryWidthOrDiameter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationAncillaryUsage..::..AncillaryWidthOrDiameter Property
FabricationAncillaryUsage Class See Also
---
Width or diameter of required ancillary.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public double AncillaryWidthOrDiameter { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AncillaryWidthOrDiameter As Double
	Get
```

Visual C++
---
```text
public:
property double AncillaryWidthOrDiameter {
	double get ();
}
```

# See Also
FabricationAncillaryUsage Class
Autodesk.Revit.DB Namespace